mod checksum;
mod cli;
mod extract;
mod footer;
mod implant;
mod inspect;
use colored::Colorize;
use cli::Cmd::*;
fn main() {
    ban();
    let res = match cli::prs() {
        Ok(Imp(pay, hos)) =>
            implant::run(&pay, &hos),
        Ok(Ext(hos)) =>
            extract::run(&hos),
        Ok(Ins(hos)) =>
            inspect::run(&hos),
        Err(err) => Err(err),
    };
    if let Err(err) = res {
        eprintln!("Error: {err}");
    }
}
fn ban() {
    println!();
    println!(
        "{}",
r#"██████╗ ██╗  ██╗ ██████╗ ███████╗████████╗
██╔════╝ ██║  ██║██╔═══██╗██╔════╝╚══██╔══╝
██║  ███╗███████║██║   ██║███████╗   ██║
██║   ██║██╔══██║██║   ██║╚════██║   ██║
╚██████╔╝██║  ██║╚██████╔╝███████║   ██║
 ╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝
"#
        .bright_yellow()
    );
    println!(
        "{}",
        "        Binary Intelligence Terminal"
            .bright_cyan()
    );
}